

#Область ПрограммныйИнтерфейс

// Массив метаданных по коммитам.
// 
// Параметры:
//  Коммиты - Массив из СправочникСсылка.Коммиты
// 
// Возвращаемое значение:
//  Массив Из Строка
Функция МассивМетаданныхПоКоммитам(Коммиты) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КоммитыИзмененныеФайлы.ИмяМетаданных КАК ИмяМетаданных
	|ИЗ
	|	Справочник.Коммиты.ИзмененныеФайлы КАК КоммитыИзмененныеФайлы
	|ГДЕ
	|	КоммитыИзмененныеФайлы.Ссылка В (&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	КоммитыИзмененныеФайлы.ИмяМетаданных";
	Запрос.УстановитьПараметр("Ссылка", Коммиты);
	МетаданныеМассив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяМетаданных");
	
	Возврат МетаданныеМассив;
КонецФункции


#КонецОбласти