

#Область ПрограммныйИнтерфейс

// Получить описание хранилища.
// 
// Параметры:
//  ГитХранилище Гит хранилище
// 
// Возвращаемое значение:
//  Структура - Получить описание хранилища:
// * Каталог - Строка -
// * Проект -  - 
Функция ПолучитьОписаниеХранилища(ГитХранилище) Экспорт
	Результат = Новый Структура("Каталог", ГитХранилище.Каталог);
	Результат.Вставить("Проект", ГитХранилище.Проект);   
	
	Возврат Результат;
КонецФункции

// Параметры для работы с конфигурацией.
// 
// Параметры:
//  Конфигурация - СправочникСсылка.Конфигурации - Конфигурация
// 
// Возвращаемое значение:
//  Структура - Параметры для работы с конфигурацией:
// * КонфигурацияФайловая - Булево 
// * КонфигурацияПуть - Строка
// * КонфигурацияПароль - Строка
// * ХранилищеПодключено - Булево
// * ХранилищеПуть -  Строка
// * ХранилищеПользователь - Строка
// * ХранилищеПароль - Строка
// * СКЛСервер - Строка
// * СКЛЛогин - Строка
// * СКЛПароль - Строка
// * ВерсияПлатформы - Строка
// * СКЛИмяБазыДанных - Строка
// * КонфигурацияПользователь - Строка 
Функция ПараметрыДляРаботыСКонфигурацией(Конфигурация) Экспорт
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Конфигурации.Файловая,
	|	Конфигурации.ПутьКБазе,
	|	Конфигурации.Пользователь,
	|	Конфигурации.Пароль,
	|	Конфигурации.ПодключенаКХранилищу,
	|	Конфигурации.ПутьКХранилищу,
	|	Конфигурации.ПользовательХранилища,
	|	Конфигурации.ПарольХранилища,
	|	Конфигурации.СерверСКЛ.Сервер,
	|	Конфигурации.СерверСКЛ.Логин,
	|	Конфигурации.СерверСКЛ.Пароль,
	|	Конфигурации.ВерсияПлатформы,
	|	Конфигурации.СерверСКЛ.Наименование
	|ИЗ
	|	Справочник.Конфигурации КАК Конфигурации
	|ГДЕ
	|	Конфигурации.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Конфигурация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Результат = Новый Структура();
	Результат.Вставить("КонфигурацияФайловая", Выборка.Файловая);
	Результат.Вставить("КонфигурацияПуть", Выборка.ПутьКБазе);
	Результат.Вставить("КонфигурацияПользователь", Выборка.Пользователь);
	Результат.Вставить("КонфигурацияПароль", Выборка.Пароль);
	Результат.Вставить("ХранилищеПодключено", Выборка.Пароль);
	Результат.Вставить("ХранилищеПуть", Выборка.ПутьКХранилищу);
	Результат.Вставить("ХранилищеПользователь", Выборка.ПользовательХранилища);
	Результат.Вставить("ХранилищеПароль", Выборка.ПарольХранилища);
	Результат.Вставить("СКЛСервер", Выборка.СерверСКЛСервер);
	Результат.Вставить("СКЛИмяБазыДанных", Выборка.СерверСКЛНаименование);
	Результат.Вставить("СКЛЛогин", Выборка.СерверСКЛЛогин);
	Результат.Вставить("СКЛПароль", Выборка.СерверСКЛПароль);
	Результат.Вставить("ВерсияПлатформы", Выборка.ВерсияПлатформы);
	
	Возврат Результат;
КонецФункции

// Параметры выполнения.
// 
// Возвращаемое значение:
//  Структура - Параметры выполнения:
// * РабочийКаталог - Произвольный, Строка -
// * КаталогПлатформ - Произвольный, Строка -
Функция ПараметрыВыполнения() Экспорт
	Результат = Новый Структура();
	
	Результат.Вставить("РабочийКаталог", Константы.РабочаяПапка.Получить());
	Результат.Вставить("КаталогПлатформ", Константы.КаталогПлатформ.Получить());
	
	Возврат Результат;
КонецФункции
#КонецОбласти

