
&НаКлиенте
Процедура ОбновитьСписокФайлов(Команда)
	//chcp 65001 && git show --name-only 15e3f96d9bd3351b020b138d532a3337d4e1913a > C:\tmp\1.txt
	Объект.ИзмененныеФайлы.Очистить();
	
	Файлы = РаботаСГитомКлиентСервер.ПолучитьСписокИзменений(Объект.Владелец, Объект.Идентификатор);
	СоответствиеПапкаМетаданные = РаботаСГитомКлиентСервер.ПолучитьСоответствияМетаданныхПапкам();
	
	Для Каждого СтрокаФайла Из Файлы Цикл
		НоваяСтрока = Объект.ИзмененныеФайлы.Добавить();
		НоваяСтрока.ИмяФайла = СтрокаФайла.ИмяФайла;
		
		ОписаниеМета = РаботаСГитомКлиентСервер.РазобратьСтрокуНаМетаданные(СтрокаФайла.ИмяФайла, СоответствиеПапкаМетаданные);
		НоваяСтрока.ИмяМетаданных = ОписаниеМета.ПолныйПутьКМетаданному;
	КонецЦикла;
	
КонецПроцедуры

