
#Область ПрограммныйИнтерфейс

Функция ПутьEDTВПутьXML(ОтносительныйПуть) Экспорт
	РазобранныйПуть = СтрРазделить(ОтносительныйПуть, "/", Ложь);
	Результат = "";
	
	Граница = РазобранныйПуть.ВГраница();
	
	Если РазобранныйПуть.Количество() = 2 Тогда
		Если РазобранныйПуть[1] = "Configuration.mdo" Тогда
			Результат = "/Configuration.xml";
		КонецЕсли;
		
	ИначеЕсли РазобранныйПуть.Количество() = 3 Тогда
		
		//Общие модули, непосредственно объекты, кроме подсистем
		Расширение = Прав(РазобранныйПуть[2], 4);
		Если Расширение = ".bsl" Тогда
			//Модуль, например общий
			Для Сч = 0 По 1 Цикл
				Результат = Результат + "/" + РазобранныйПуть[Сч];
			КонецЦикла;
			Результат = Результат + "/Ext/";
			Результат = Результат + РазобранныйПуть[2];
		ИначеЕсли Расширение = ".mdo" Тогда
			// Объект
			//Для Сч = 0 По 0 Цикл
			//	Результат = Результат + "/" + РазобранныйПуть[Сч];
			//КонецЦикла;       
			Результат = РазобранныйПуть[0];
			Результат = Результат + "/" + СтрЗаменить(РазобранныйПуть[2], ".mdo", ".xml");
		ИначеЕсли СтрЗаканчиваетсяНа(РазобранныйПуть[РазобранныйПуть.ВГраница()], ".rights") Тогда
			
			Результат = "Roles/" + РазобранныйПуть[РазобранныйПуть.ВГраница() - 1] + ".xml";
		КонецЕсли;
		
	ИначеЕсли РазобранныйПуть.Количество() > 3 Тогда
		
		Если РазобранныйПуть[2] = "Forms" Тогда
			//Формы
			Расширение = Прав(РазобранныйПуть[РазобранныйПуть.ВГраница()], 4);
			
			// Модуль
			Если Расширение = ".bsl"
			Или Прав(РазобранныйПуть[РазобранныйПуть.ВГраница()], 5) = ".form" Тогда
			
				Для Сч = 0 По РазобранныйПуть.ВГраница() - 2 Цикл
					Результат = Результат + "/" + РазобранныйПуть[Сч];
				КонецЦикла;
				Результат = Результат + "/" + СтрШаблон("%1.xml", РазобранныйПуть[Граница - 1]);
				
			КонецЕсли;
			
		ИначеЕсли Прав(РазобранныйПуть[РазобранныйПуть.ВГраница()], 4) = ".dcs" Тогда
			Для Сч = 0 По РазобранныйПуть.ВГраница() - 2 Цикл
				Результат = Результат + "/" + РазобранныйПуть[Сч];
			КонецЦикла;
			Результат = Результат + "/" + СтрШаблон("%1.xml", РазобранныйПуть[Граница - 1]);
			
		ИначеЕсли РазобранныйПуть[2] = "Subsystems" Тогда
			Расширение = Прав(РазобранныйПуть[РазобранныйПуть.ВГраница()], 4);
			
			Для Сч = 0 По Граница - 2 Цикл
				Результат = Результат + "/" + РазобранныйПуть[Сч];
			КонецЦикла;
			
			Если Расширение = ".mdo" Тогда
				Результат = Результат + "/" + РазобранныйПуть[Граница - 1] + ".xml";
				//Результат = Результат + "/" + СтрЗаменить(РазобранныйПуть[РазобранныйПуть.ВГраница()], ".mdo", ".xml");
			ИначеЕсли Расширение = ".cmi" Тогда
				Результат = Результат + "/Ext/" + СтрЗаменить(РазобранныйПуть[РазобранныйПуть.ВГраница()], ".cmi", ".xml");
			КонецЕсли;
		ИначеЕсли РазобранныйПуть[2] = "Templates" Тогда
			Для Сч = 0 По Граница - 1 Цикл
				Результат = Результат + "/" + РазобранныйПуть[сч];
			КонецЦикла;
			Результат = Результат + ".xml";
		КонецЕсли;
			
	КонецЕсли;

	Возврат Результат;
	
КонецФункции


Функция ПутьКМетаданнымВПутьXML(ПутьКМетаданным) Экспорт
	СоответствиеИменаМетаданныхПапки = РаботаСГитомКлиентСервер.ПолучитьСоответствияМетаданныхПапкам();
	
	РазделенныйПуть = СтрРазделить(ПутьКМетаданным, ".");
	Если РазделенныйПуть.Количество() = 1
	И РазделенныйПуть[0] = "Configuration" Тогда
		Возврат ПутьККорнюКонфигурации();
	ИначеЕсли РазделенныйПуть.Количество() = 2 Тогда // Отдельный объект
		Возврат ПутьКОбъектуXML(РазделенныйПуть);
	Иначе
		Возврат ПутьКОбъектуXMLПроизвольный(РазделенныйПуть);
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Функция ПутьККорнюКонфигурации()
	Возврат "Configuration.xml";
КонецФункции

Функция ПутьКОбъектуXML(РазделенныйПутьПутьКМетаданным)
	Соответствие = РаботаСГитомКлиентСервер.ПолучитьСоответствияМетаданныхПапкам();
	
	ПутьККаталогуМассив = Новый Массив;
	
	ВидМетаданного = РазделенныйПутьПутьКМетаданным[0];
	Каталог = Соответствие[ВидМетаданного];
	Если Не ЗначениеЗаполнено(Каталог) Тогда
		ВызватьИсключение СтрШаблон("Вид метаданного ""%1"" не найден!", Каталог);
	КонецЕсли;
	
	ПутьККаталогуМассив.Добавить(Каталог);
	ИмяОбъекта = РазделенныйПутьПутьКМетаданным[1];
	
	ПутьККаталогуМассив.Добавить(СтрШаблон("%1.xml", ИмяОбъекта));
	
	Возврат СтрСоединить(ПутьККаталогуМассив, "/");
	
КонецФункции

Функция ПутьКОбъектуXMLПроизвольный(РазделенныйПутьПутьКМетаданным)
	Граница = РазделенныйПутьПутьКМетаданным.ВГраница();
	
	КонечныйОбъект = РазделенныйПутьПутьКМетаданным[Граница];
	Если СтрЗаканчиваетсяНа(КонечныйОбъект, "Module") Тогда
		Формат = "bsl";
	Иначе
		Формат = "xml";
	КонецЕсли;
	
	Если КонечныйОбъект = "Form" Тогда
		Граница = Граница - 1;
	КонецЕсли;
	
	Соответствие = РаботаСГитомКлиентСервер.ПолучитьСоответствияМетаданныхПапкам();
	
	ИтоговыйПутьМассив = Новый Массив;
	Для Сч = 0 По Граница Цикл
		НачальныйПуть = РазделенныйПутьПутьКМетаданным[Сч];
		Если Сч % 2 = 0 Тогда
			Если СтрЗаканчиваетсяНа(НачальныйПуть, "Module") Тогда
				ИтоговыйПУть = СтрШаблон("Ext/%1", НачальныйПуть);
			Иначе
				ИтоговыйПуть = Соответствие[НачальныйПуть];
				Если Не ЗначениеЗаполнено(ИтоговыйПуть) Тогда
					ВызватьИсключение СтрШаблон("Не найдено соответствие поля ""%1"".", НачальныйПуть);
				КонецЕсли;
			КонецЕсли;
		Иначе
			ИтоговыйПуть = НачальныйПуть;
		КонецЕсли;
		
		Если Сч = Граница Тогда
			ИтоговыйПуть = СтрШаблон("%1.%2", ИтоговыйПуть, Формат);
		КонецЕсли;
		ИтоговыйПутьМассив.Добавить(ИтоговыйПуть);
	КонецЦикла;
	
	Возврат СтрСоединить(ИтоговыйПутьМассив, "/");
КонецФункции


#КонецОбласти
