
#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьИзБазыИсточника(Команда)

	ПараметрыКонфигурацииИсточник = РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией(БазаИсточник, Проект);
	ПараметрыКонфигурацииПриемник = РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией(БазаПриемник, Проект);
	
	Если НЕ ИспользоватьПлатформуИсточника Тогда
		ПараметрыКонфигурацииИсточник.ВерсияПлатформы = ПараметрыКонфигурацииПриемник.ВерсияПлатформы; // Выгружаем той же версией
	КонецЕсли;
	
	ПараметрыВыполнения = РаботаСГитомВызовСервера.ПараметрыВыполнения();
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаКоммиты Тогда
		МетаданныеКВыгрузке = МетаданныеКВыгрузкеПоКоммитам();
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДерево Тогда
		МетаданныеКВыгрузке = МетаданныеКВыгрузкеПоДереву();
	КонецЕсли;
	
	Индекс = МетаданныеКВыгрузке.Найти("Configuration");
	
	Если Индекс <> Неопределено Тогда
		КореньКонфигурацииИсточника = ВыгрузитьКорень(ПараметрыКонфигурацииИсточник);
		МетаданныеКВыгрузке.Удалить(Индекс);
		
		КореньКонфигурацииПриемника = ВыгрузитьКорень(ПараметрыКонфигурацииПриемник);
	КонецЕсли;
	
	КомандаКВыполнению = РаботаСКонфигурациейКлиентСервер.КомандаДляЗапускаВыгрузкиОбъектовIBCMD(ПараметрыВыполнения, 
		ПараметрыКонфигурацииИсточник, МетаданныеКВыгрузке, Истина);
	
	ИмяФайлаЛога = ПараметрыВыполнения.РабочийКаталог + "\log.txt"; 
	РаботаСКонфигурациейКлиентСервер.ДобавитьВыводВФайл(КомандаКВыполнению, ПараметрыВыполнения, ИмяФайлаЛога);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КомандаКВыполнению);
	ОчиститьРабочийКаталог(ПараметрыВыполнения);
	ЗапуститьПриложение(КомандаКВыполнению,, Истина);
	
	Каталог = ПараметрыВыполнения.РабочийКаталог + "\bd\";
	Если КореньКонфигурацииИсточника <> Неопределено Тогда
		Для Каждого ФайлСоответствие Из КореньКонфигурацииИсточника.Файлы Цикл
			ИтоговыйФайлПуть = СтрЗаменить(ФайлСоответствие.Ключ, КореньКонфигурацииИсточника.Каталог, Каталог);
			ФайлСоответствие.Значение.Записать(ИтоговыйФайлПуть);
		КонецЦикла;
		ЗаписатьИнформациюОПоддержке(КореньКонфигурацииПриемника, Каталог);
	КонецЕсли;
	
	ПрочитатьЛог(ИмяФайлаЛога);

	
КонецПроцедуры 


&НаКлиенте
Процедура Подбор(Команда)                         
	ПараметрыОткрытия = Новый Структура("ЗакрыватьПриВыборе", Ложь);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Истина);
	
	Отбор = Новый Структура("Владелец", Проект);
	ПараметрыОткрытия.Вставить("Отбор",  Отбор);
	
	ОткрытьФорму("Справочник.Коммиты.ФормаВыбора", ПараметрыОткрытия, Элементы.Коммиты);
КонецПроцедуры

&НаКлиенте
Процедура ЗахватитьВБазеПриемнике(Команда)
	ПараметрыКонфигурации = РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией(БазаПриемник, Проект);
	ПараметрыВыполнения = РаботаСГитомВызовСервера.ПараметрыВыполнения();
	
	КоммитыДляЗахвата = Новый Массив;
	Для Каждого КоммитСтрока Из Коммиты Цикл
		КоммитыДляЗахвата.Добавить(КоммитСтрока.Коммит);
	КонецЦикла;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаКоммиты Тогда
		МетаданныеКВыгрузке = МетаданныеКВыгрузкеПоКоммитам();
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДерево Тогда
		МетаданныеКВыгрузке = МетаданныеКВыгрузкеПоДереву();
	КонецЕсли;
	
	ТекстФайлаДляЗахвата = РаботаСКонфигурациейКлиентСервер.МассивМетаданныхВХМЛДляЗахвата(МетаданныеКВыгрузке);
	
	ПутьКФайлу = РаботаСКонфигурациейКлиентСервер.ПутьКФайлуХМЛДляХранилища(ПараметрыВыполнения);
	
	ТекстовыйФайл = Новый ТекстовыйДокумент();
	ТекстовыйФайл.УстановитьТекст(ТекстФайлаДляЗахвата);
	ТекстовыйФайл.Записать(ПутьКФайлу);
	
	КомандаКВыполнению = РаботаСКонфигурациейКлиентСервер.КомандаДляЗахватаОбъектовВХранилищеРежимПакетный(ПараметрыВыполнения, 
		ПараметрыКонфигурации, ПутьКФайлу);
	
	ИмяФайлаЛога = ПараметрыВыполнения.РабочийКаталог + "\log.txt"; 
	РаботаСКонфигурациейКлиентСервер.ДобавитьВыводВФайл(КомандаКВыполнению, ПараметрыВыполнения, ИмяФайлаЛога);
	ЗапуститьПриложение(КомандаКВыполнению);
	
	ПрочитатьЛог(ИмяФайлаЛога);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗапуститьКонфигураторПриемник(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКонфигДампИнфо(Команда)
	ПараметрыКонфигурации = РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией(БазаИсточник, Проект);
	ПараметрыВыполнения = РаботаСГитомВызовСервера.ПараметрыВыполнения();
	
	СохранитьКонфигДампИнфо(ПараметрыВыполнения,  ПараметрыКонфигурации);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбъекты(Команда)
	ПараметрыВыполнения = РаботаСГитомВызовСервера.ПараметрыВыполнения();
	
	КаталогБД = ПараметрыВыполнения.РабочийКаталог + "\bd\";
	Файл = Новый Файл(КаталогБД);
	Если НЕ Файл.Существует()  Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Нет выгрузки");
		Возврат;
	КонецЕсли;
	
	ФайлыКЗагрузкеОтносительные = ФайлыКЗагрузке();
	
	ФайлыКЗагрузкеСтроки = Новый Массив;

	Для Сч = 0 По ФайлыКЗагрузкеОтносительные.ВГраница() Цикл
		ОтносительныйПутьКФайлуEDT = ФайлыКЗагрузкеОтносительные[Сч];
		
		ПутьКФайлу = ПутьEDTВПутьКонфигуратора(ОтносительныйПутьКФайлуEDT);
		ФайлыКЗагрузкеСтроки.Добавить(ПутьКФайлу);
	КонецЦикла;
	
	ИтоговыйСписок = Новый Массив;
	ИтоговыйСписокОтносительный = Новый Массив;
	Для Сч = 0 По ФайлыКЗагрузкеСтроки.ВГраница() Цикл
		
		ОтносительныйПутьКФайлу = ФайлыКЗагрузкеСтроки[Сч];
		Файл = Новый Файл(КаталогБД + СтрЗаменить(ОтносительныйПутьКФайлу, "/", "\"));
		Если Не Файл.Существует() Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Файл.ПолноеИмя + " Не существует!");
			Продолжить;
		КонецЕсли;
		
		Если СокрЛП(ОтносительныйПутьКФайлу) = "" Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьИтоговый = КаталогБД + СтрЗаменить(ОтносительныйПутьКФайлу, "/", "\");
		Если ИтоговыйСписок.Найти(ПутьИтоговый) = Неопределено Тогда
			ИтоговыйСписок.Добавить(ПутьИтоговый);
		КонецЕсли;
		
		Если Лев(ОтносительныйПутьКФайлу, 1) = "/" Тогда
			ОтносительныйПутьКФайлу = Сред(ОтносительныйПутьКФайлу, 2);
		КонецЕсли;
		ПутьИтоговый = СтрЗаменить(ОтносительныйПутьКФайлу, "/", "\");
		Если ИтоговыйСписокОтносительный.Найти(ПутьИтоговый) = Неопределено Тогда
			ИтоговыйСписокОтносительный.Добавить(ПутьИтоговый);
		КонецЕсли;
		
	КонецЦикла;
		
	ПараметрыКонфигурацииПриемник = РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией(БазаПриемник, Проект);
	Если ИспользоватьПлатформуИсточника Тогда
		ПараметрыКонфигурацииИсточник = РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией(БазаИсточник, Проект);
		
		ПараметрыКонфигурацииПриемник.ВерсияПлатформы = ПараметрыКонфигурацииИсточник.ВерсияПлатформы;
	КонецЕсли;
	
	КомандаЗапуска = РаботаСКонфигурациейКлиентСервер.КомандаДляЗапускаЗагрузкиОбъектовBICMD(ПараметрыВыполнения,
		ПараметрыКонфигурацииПриемник, ИтоговыйСписокОтносительный);
		
	ИмяФайлаЛога = ПараметрыВыполнения.РабочийКаталог + "\log.txt"; 
	РаботаСКонфигурациейКлиентСервер.ДобавитьВыводВФайл(КомандаЗапуска, ПараметрыВыполнения, ИмяФайлаЛога);
	
	ЗапуститьПриложение(КомандаЗапуска,, Истина);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КомандаЗапуска);
	ПрочитатьЛог(ИмяФайлаЛога);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСтруктуруИнформационнойБазы(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры

&НаКлиенте
Процедура РежимРаботыПриИзменении(Элемент)
	ПриИзмененииРежимаРаботы(Элементы, РежимРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДеревоКонфигурации(Команда)
	ПараметрыКонфигурации = РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией(БазаИсточник, Проект);
	ПараметрыВыполнения = РаботаСГитомВызовСервера.ПараметрыВыполнения();
	
	СохранитьКонфигДампИнфо(ПараметрыВыполнения,  ПараметрыКонфигурации);
	
	Файл = Новый Файл(ПараметрыВыполнения.РабочийКаталог + "\bd\ConfigDumpInfo.xml");
	Если НЕ Файл.Существует() Тогда
		ВызватьИсключение "Не найден ConfigDumpInfo";
	КонецЕсли;
	
	ДвоичныеДанные = Новый ДвоичныеДанные(Файл.ПолноеИмя);
	ЗаполнитьДеревоКонфигурацииПоФайлуНаСервере(ДвоичныеДанные);
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоКонфигурацииПоФайлуНаСервере(Знач ДвоичныеДанные)
	#Если Сервер и Не Сервер Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные;
	#КонецЕсли
	Поток = ДвоичныеДанные.ОткрытьПотокДляЧтения();
	
	ДеревоОбъект = РазборКонфигДампИнфо.РазобратьФайл(Поток);
	
	Поток.Закрыть();
	ЗначениеВРеквизитФормы(ДеревоОбъект, "ДеревоКонфигурации");
КонецПроцедуры


&НаКлиенте
Процедура ОчиститьРабочийКаталог(ПараметрыВыполнения)
	УдалитьФайлы(ПараметрыВыполнения.РабочийКаталог + "\", "*");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКонфигДампИнфо(ПараметрыВыполнения, ПараметрыКонфигурации) 
	УдалитьФайлы(ПараметрыВыполнения.РабочийКаталог + "\", "*");
	
	КомандаКВыполнению = РаботаСКонфигурациейКлиентСервер.КомандаДляВыгрузкиКонфигДампИнфоРежимПакетный(ПараметрыВыполнения, 
		ПараметрыКонфигурации);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КомандаКВыполнению);

		
	ИмяФайлаЛога = ПараметрыВыполнения.РабочийКаталог + "\log.txt";
	РаботаСКонфигурациейКлиентСервер.ДобавитьВыводВФайл(КомандаКВыполнению, ПараметрыВыполнения, ИмяФайлаЛога);
	ЗапуститьПриложение(КомандаКВыполнению,, Истина);
	
КонецПроцедуры


&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииРежимаРаботы(Элементы, РежимРаботы)
	
	Если РежимРаботы = "ПоКоммитам" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаКоммиты;
	ИначеЕсли РежимРаботы = "ПоДереву" Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.СтраницаДерево;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПутьEDTВПутьКонфигуратора(ОтносительныйПуть)
	РазобранныйПуть = СтрРазделить(ОтносительныйПуть, "/", Ложь);
	Результат = "";
	
	Граница = РазобранныйПуть.ВГраница();
	
	Если РазобранныйПуть.Количество() = 2 Тогда
		Если РазобранныйПуть[1] = "Configuration.mdo" Тогда
			Результат = "/Configuration.xml";
		КонецЕсли;
		
	ИначеЕсли РазобранныйПуть.Количество() = 3 Тогда
		
		//Общие модули, непосредственно объекты, кроме подсистем
		Расширение = Прав(РазобранныйПуть[2], 4);
		Если Расширение = ".bsl" Тогда
			//Модуль, например общий
			Для Сч = 0 По 1 Цикл
				Результат = Результат + "/" + РазобранныйПуть[Сч];
			КонецЦикла;
			Результат = Результат + "/Ext/";
			Результат = Результат + РазобранныйПуть[2];
		ИначеЕсли Расширение = ".mdo" Тогда
			// Объект
			//Для Сч = 0 По 0 Цикл
			//	Результат = Результат + "/" + РазобранныйПуть[Сч];
			//КонецЦикла;       
			Результат = РазобранныйПуть[0];
			Результат = Результат + "/" + СтрЗаменить(РазобранныйПуть[2], ".mdo", ".xml");
		КонецЕсли;
		
	ИначеЕсли РазобранныйПуть.Количество() > 3 Тогда
		
		Если РазобранныйПуть[2] = "Forms" Тогда
			//Формы
			Расширение = Прав(РазобранныйПуть[РазобранныйПуть.ВГраница()], 4);
			
			// Модуль
			Если Расширение = ".bsl"
			Или Прав(РазобранныйПуть[РазобранныйПуть.ВГраница()], 5) = ".form" Тогда
			
				Для Сч = 0 По РазобранныйПуть.ВГраница() - 2 Цикл
					Результат = Результат + "/" + РазобранныйПуть[Сч];
				КонецЦикла;
				Результат = Результат + "/" + СтрШаблон("%1.xml", РазобранныйПуть[Граница - 1]);
				
			КонецЕсли;
			
		ИначеЕсли Прав(РазобранныйПуть[РазобранныйПуть.ВГраница()], 4) = ".dcs" Тогда
			Для Сч = 0 По РазобранныйПуть.ВГраница() - 2 Цикл
				Результат = Результат + "/" + РазобранныйПуть[Сч];
			КонецЦикла;
			Результат = Результат + "/" + СтрШаблон("%1.xml", РазобранныйПуть[Граница - 1]);
			
		ИначеЕсли РазобранныйПуть[2] = "Subsystems" Тогда
			Расширение = Прав(РазобранныйПуть[РазобранныйПуть.ВГраница()], 4);
			
			Для Сч = 0 По Граница - 2 Цикл
				Результат = Результат + "/" + РазобранныйПуть[Сч];
			КонецЦикла;
			
			Если Расширение = ".mdo" Тогда
				Результат = Результат + "/" + РазобранныйПуть[Граница - 1] + ".xml";
				//Результат = Результат + "/" + СтрЗаменить(РазобранныйПуть[РазобранныйПуть.ВГраница()], ".mdo", ".xml");
			ИначеЕсли Расширение = ".cmi" Тогда
				Результат = Результат + "/Ext/" + СтрЗаменить(РазобранныйПуть[РазобранныйПуть.ВГраница()], ".cmi", ".xml");
			КонецЕсли;
		ИначеЕсли РазобранныйПуть[2] = "Templates" Тогда
			Для Сч = 0 По Граница - 1 Цикл
				Результат = Результат + "/" + РазобранныйПуть[сч];
			КонецЦикла;
			Результат = Результат + ".xml";
		КонецЕсли;
			
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыгрузитьКорень(ПараметрыКонфигурации)
	КореньКВыгрузкеМетаданные = Новый Массив;
	КореньКВыгрузкеМетаданные.Добавить("Configuration");
	
	ПараметрыВыполнения = РаботаСГитомВызовСервера.ПараметрыВыполнения();
	ВременныйКаталог = ПолучитьИмяВременногоФайла() + "\";
	СоздатьКаталог(ВременныйКаталог);
	
	ПараметрыВыполнения.РабочийКаталог = ВременныйКаталог;
	
	КомандаКВыполнению = РаботаСКонфигурациейКлиентСервер.КомандаДляЗапускаВыгрузкиОбъектовIBCMD(ПараметрыВыполнения, 
		ПараметрыКонфигурации, КореньКВыгрузкеМетаданные);
	ЗапуститьПриложение(КомандаКВыполнению,, Истина);
	
	Результат = Новый Структура("Каталог, Файлы", "", Новый Соответствие);
	Результат.Каталог = ВременныйКаталог + "bd";
	
	Файлы = НайтиФайлы(ВременныйКаталог + "\bd", "*", Истина);
	
	Для Каждого Файл Из Файлы Цикл
		Если Файл.ЭтоФайл() Тогда
			Результат.Файлы[Файл.ПолноеИмя] = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		КонецЕсли;
	КонецЦикла;
	УдалитьФайлы(ВременныйКаталог, "*");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция МетаданныеКВыгрузкеПоКоммитам()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КоммитыИзмененныеФайлы.ИмяМетаданных КАК ИмяМетаданных
	|ИЗ
	|	Справочник.Коммиты.ИзмененныеФайлы КАК КоммитыИзмененныеФайлы
	|ГДЕ
	|	КоммитыИзмененныеФайлы.Ссылка В (&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	КоммитыИзмененныеФайлы.ИмяМетаданных";
	Запрос.УстановитьПараметр("Ссылка", Коммиты.Выгрузить().ВыгрузитьКолонку("Коммит"));
	МетаданныеКВыгрузке = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ИмяМетаданных");
	Возврат МетаданныеКВыгрузке;
КонецФункции

&НаСервере
Функция МетаданныеКВыгрузкеПоДереву()
	Отбор = Новый Структура("Выбран", Истина);
	Дерево = РеквизитФормыВЗначение("ДеревоКонфигурации");
	
	НайденныеСтроки = Дерево.Строки.НайтиСтроки(Отбор, Истина);
	
	МассивМетаданных = Новый Массив;
	Для Каждого СтрокаДерева Из НайденныеСтроки Цикл
		ДобавитьВМассивВыбранныеМетаданныеСПодчиненными(МассивМетаданных, СтрокаДерева);
	КонецЦикла;
	МассивМетаданных = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивМетаданных);
	
	Возврат МассивМетаданных;
	
КонецФункции

&НаСервере
Процедура ДобавитьВМассивВыбранныеМетаданныеСПодчиненными(МассивМетаданных, Строка)
	МассивМетаданных.Добавить(Строка.ПолноеИмя);
	Для Каждого ПодчиненнаяСтрока Из Строка.Строки Цикл
		ДобавитьВМассивВыбранныеМетаданныеСПодчиненными(МассивМетаданных, ПодчиненнаяСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ФайлыКЗагрузке()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	КоммитыИзмененныеФайлы.ИмяФайла КАК ИмяФайла
	|ИЗ
	|	Справочник.Коммиты.ИзмененныеФайлы КАК КоммитыИзмененныеФайлы
	|ГДЕ
	|	КоммитыИзмененныеФайлы.Ссылка В(&Ссылка)";
	Запрос.УстановитьПараметр("Ссылка", Коммиты.Выгрузить().ВыгрузитьКолонку("Коммит"));
	
	ТЗФайлыКЗагрузке = Запрос.Выполнить().Выгрузить();
	
	Возврат ТЗФайлыКЗагрузке.ВыгрузитьКолонку("ИмяФайла");
КонецФункции

&НаКлиенте
Процедура ПрочитатьЛог(Файл)
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(Файл, КодировкаТекста.UTF8);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстовыйДокумент.ПолучитьТекст());
КонецПроцедуры

&НаКлиенте
Процедура КоммитыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Для Каждого Коммит Из ВыбранноеЗначение Цикл
		СуществующиеСтроки = Коммиты.НайтиСтроки(Новый Структура("Коммит", Коммит));
		Если СуществующиеСтроки.Количество() = 0 Тогда
			НоваяСтрока = Коммиты.Добавить();
			НоваяСтрока.Коммит = Коммит;
		Иначе
			Элементы.Коммиты.ТекущаяСтрока = СуществующиеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИнформациюОПоддержке(КореньКонфигурации, КонечныйКаталог)
	Для Каждого ФайлСоответствие Из КореньКонфигурации.Файлы Цикл
		ОтносительныйПуть = СтрЗаменить(ФайлСоответствие.Ключ, КореньКонфигурации.Каталог, "");
		
		РазобранныйПуть = СтрРазделить(ОтносительныйПуть, "\", Ложь);
		Если РазобранныйПуть.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ВРЕГ(СокрЛП(РазобранныйПуть[0])) <> Врег("Ext") Тогда
			Продолжить;
		КонецЕсли;
		
		Если Врег(РазобранныйПуть[1]) = Врег("ParentConfigurations.bin") Тогда
			ФайлСоответствие.Значение.Записать(КонечныйКаталог + ОтносительныйПуть);
			Продолжить;
		КонецЕсли;
		
		Если РазобранныйПуть.Количество() < 3 Тогда
			Продолжить;
		КонецЕсли;
		
		Если Врег(РазобранныйПуть[1]) = Врег("ParentConfigurations") Тогда
			ФайлСоответствие.Значение.Записать(КонечныйКаталог + ОтносительныйПуть);
		КонецЕсли;
		
	КонецЦикла;     
	
КонецПроцедуры




#КонецОбласти


