
#Область ПрограммныйИнтерфейс

// Команда для запуска выгрузки объектов.
// 
// Параметры:
//  ПараметрыВыполнения - см. РаботаСГитомВызовСервера.ПараметрыВыполнения
//  ПараметрыКонфигурации - см. РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией
//  МетаданныеКВыгрузке - Массив Из Строка
// 
// Возвращаемое значение:
//  Строка - Команда для запуска выгрузки объектов
Функция КомандаДляЗапускаВыгрузкиОбъектов(ПараметрыВыполнения, ПараметрыКонфигурации, МетаданныеКВыгрузке, Рекурсивно = Ложь) Экспорт
	ШаблонКоманды = """%1CBIN%\%1CVERSION%\bin\ibcmd.exe"" infobase config export objects %R% %OBJECTS_LIST% --out=""%WORKING_DIR%\bd"" " +
		"--db-server=""%SQL_SERVER_NAME%"" --dbms=MSSQLServer --db-name=""%SQL_BD_NAME%"" --db-user=""%SQL_DB_USER%"" " + 
		"--db-pwd=""%SQL_DB_PWD%"" " + 
		"--user=""%1C_USER%"" --password=""%1C_PWD%""";
		
	СтрокаВыполнения = ЗаполнитьОбщиеПараметрыСтроки(ПараметрыВыполнения, ПараметрыКонфигурации, ШаблонКоманды);
	СтрокаМетаданных = СтрСоединить(МетаданныеКВыгрузке, " ");
	СтрокаВыполнения = СтрЗаменить(СтрокаВыполнения, "%OBJECTS_LIST%", СтрокаМетаданных);
	СтрокаВыполнения = СтрЗаменить(СтрокаВыполнения, "%R%", ?(Рекурсивно, "-r", ""));
	
	Возврат СтрокаВыполнения;
КонецФункции   

Функция КомандаДляЗапускаЗагрузкиОбъектовBICMD(ПараметрыВыполнения, ПараметрыКонфигурации, ФайлыКЗагрузке) Экспорт
	ШаблонКоманды = """%1CBIN%\%1CVERSION%\bin\ibcmd.exe"" infobase config import files " +
	"--base-dir=""%WORKING_DIR%\bd"" %LIST_FILES% " +
	"--db-server=""%SQL_SERVER_NAME%"" --dbms=MSSQLServer --db-name=""%SQL_BD_NAME%"" --db-user=""%SQL_DB_USER%"" " + 
	"--db-pwd=""%SQL_DB_PWD%"" " + 
	"--user=""%1C_USER%"" --password=""%1C_PWD%""";
	
	СтрокаВыполнения = ЗаполнитьОбщиеПараметрыСтроки(ПараметрыВыполнения, ПараметрыКонфигурации, ШаблонКоманды);
	СтрокаФайлыКЗагрузке = СтрСоединить(ФайлыКЗагрузке, """ """);
	СтрокаФайлыКЗагрузке = СтрШаблон("""%1""", СтрокаФайлыКЗагрузке);
	СтрокаВыполнения = СтрЗаменить(СтрокаВыполнения, "%LIST_FILES%", СтрокаФайлыКЗагрузке);
	
	Возврат СтрокаВыполнения;
КонецФункции

Процедура ДобавитьВыводВФайл(СтрокаВыполнения, ПараметрыВыполнения, ИмяФайла) Экспорт
	СтрокаВыполнения = "cmd /C ""chcp 65001 &&" + СтрокаВыполнения + """ 1> " + ИмяФайла  + " 2>&1";
КонецПроцедуры

// Команда для запуска захвата объектов.
// 
// Параметры:
//  ПараметрыВыполнения - см. РаботаСГитомВызовСервера.ПараметрыВыполнения
//  ПараметрыКонфигурации - см. РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией
//  МетаданныеКВыгрузке - Массив Из Строка
// 
// Возвращаемое значение:
//  Строка - Команда для запуска выгрузки объектов
Функция КомандаДляЗапускаЗахватаОбъектов(ПараметрыВыполнения, ПараметрыКонфигурации, МетаданныеКВыгрузке) Экспорт
	ШаблонКоманды = """%1CBIN%\%1CVERSION%\bin\ibcmd.exe"" config export objects %OBJECTS_LIST% --out ""%WORKING_DIR%\bd"" " +
		"--db-server=""%SQL_SERVER_NAME%"" --dbms=MSSQLServer --db-name""%SQL_BD_NAME%"" --db-user=""%SQL_DB_USER%""";
		
	СтрокаВыполнения = ЗаполнитьОбщиеПараметрыСтроки(ПараметрыВыполнения, ПараметрыКонфигурации, ШаблонКоманды);
	СтрокаМетаданных = СтрСоединить(МетаданныеКВыгрузке, " ");
	СтрокаВыполнения = СтрЗаменить(СтрокаВыполнения, "%OBJECTS_LIST%", СтрокаМетаданных);
	СтрокаВыполнения = ЗаполнитьОбщиеПараметрыСтроки(ПараметрыВыполнения, ПараметрыКонфигурации, СтрокаВыполнения);
	
	Возврат СтрокаВыполнения;
КонецФункции

Функция КомандаДляСозданияКонфигДампИнфо(ПараметрыВыполнения, ПараметрыКонфигурации) Экспорт
	ШаблонКоманды = """%1CBIN%\%1CVERSION%\bin\ibcmd.exe"" infobase config export info --out=""%WORKING_DIR%\"" " +
		"--db-server=""%SQL_SERVER_NAME%"" --dbms=MSSQLServer --db-name=""%SQL_BD_NAME%"" --db-user=""%SQL_DB_USER%"" " + 
		"--db-pwd=""%SQL_DB_PWD%"" " + 
		"--user=""%1C_USER%"" --password=""%1C_PWD%""";
		
	СтрокаВыполнения = ЗаполнитьОбщиеПараметрыСтроки(ПараметрыВыполнения, ПараметрыКонфигурации, ШаблонКоманды);
	
	Возврат СтрокаВыполнения;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСоответствие(Соответствие, Множественное, Единственное)
	Соответствие[Множественное] = Единственное;
	Соответствие[Единственное] = Множественное;
КонецПроцедуры       


// Заполнить общие параметры строки.
// 
// Параметры:
//  ПараметрыВыполнения - см. РаботаСГитомВызовСервера.ПараметрыВыполнения
//  ПараметрыКонфигурации - см. РаботаСГитомВызовСервера.ПараметрыДляРаботыСКонфигурацией
//  Шаблон - Строка - Шаблон
// 
// Возвращаемое значение:
//  Строка
Функция ЗаполнитьОбщиеПараметрыСтроки(ПараметрыВыполнения, ПараметрыКонфигурации, Знач Шаблон)
	Результат = Шаблон;
	
	
	Результат = СтрЗаменить(Результат, "%1CBIN%", ПараметрыВыполнения.КаталогПлатформ);
	Результат = СтрЗаменить(Результат, "%1CVERSION%", ПараметрыКонфигурации.ВерсияПлатформы);
	Результат = СтрЗаменить(Результат, "%WORKING_DIR%", ПараметрыВыполнения.РабочийКаталог);
	Результат = СтрЗаменить(Результат, "%SQL_SERVER_NAME%", ПараметрыКонфигурации.СКЛСервер);
	Результат = СтрЗаменить(Результат, "%SQL_BD_NAME%", ПараметрыКонфигурации.СКЛИмяБазыДанных);
	Результат = СтрЗаменить(Результат, "%SQL_DB_USER%", ПараметрыКонфигурации.СКЛЛогин);
	Результат = СтрЗаменить(Результат, "%SQL_DB_PWD%", ПараметрыКонфигурации.СКЛПароль);
	
	Результат = СтрЗаменить(Результат, "%1C_USER%", ПараметрыКонфигурации.КонфигурацияПользователь);
	Результат = СтрЗаменить(Результат, "%1C_PWD%", ПараметрыКонфигурации.КонфигурацияПароль);
	
	Возврат Результат;
КонецФункции

#КонецОбласти